In [89]:
import pandas as pd
import numpy as np

In [90]:
data = {'names':['cerci','jon','tyrion','jimmy','demon','rob','ned','robert','sansa'],
            'house':[pd.NA,'stark','lenister','lenister','targerion','stark','stark','barathon','stark'],
                'age':[30,17,27,31,38,18,50,51,14],
                    'gender':['f',pd.NA,'m','m','m',pd.NA,'m','m','f']}

In [91]:
df = pd.DataFrame(data)

In [92]:
df['gender'].fillna(df['gender'].mode()[0],inplace = True)

/tmp/ipykernel_269/4201278310.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['gender'].fillna(df['gender'].mode()[0],inplace = True)

In [93]:
# df.iloc[0,1] ='unknown'

In [94]:
df['house'].fillna('unknown',inplace = True)

/tmp/ipykernel_269/2480276597.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['house'].fillna('unknown',inplace = True)

In [95]:
df['age_group'] = df['age'].apply(lambda y:'adult' if y >= 25 else 'young')

In [96]:
df['age_group'] = np.where(df['age'] >=25 ,'adult','young')

In [97]:
df[(df['house'] =='stark') & (df['age'] < 30)]

   names  house  age gender age_group
1    jon  stark   17      m     young
5    rob  stark   18      m     young
8  sansa  stark   14      f     young

In [98]:
# df['age'].sort_values(ascending = False)

In [99]:
df.sort_values(by = 'age',inplace = True)

In [100]:
df.value_counts('house')

house
stark        4
lenister     2
barathon     1
targerion    1
unknown      1
Name: count, dtype: int64

In [101]:

df1 = df[['names', 'age_group']]

In [102]:
df1

    names age_group
8   sansa     young
1     jon     young
5     rob     young
2  tyrion     adult
0   cerci     adult
3   jimmy     adult
4   demon     adult
6     ned     adult
7  robert     adult

In [103]:
df.groupby('house')['age'].mean().sort_values()

house
stark        24.75
lenister     29.00
unknown      30.00
targerion    38.00
barathon     51.00
Name: age, dtype: float64

In [104]:
df

    names      house  age gender age_group
8   sansa      stark   14      f     young
1     jon      stark   17      m     young
5     rob      stark   18      m     young
2  tyrion   lenister   27      m     adult
0   cerci    unknown   30      f     adult
3   jimmy   lenister   31      m     adult
4   demon  targerion   38      m     adult
6     ned      stark   50      m     adult
7  robert   barathon   51      m     adult

In [105]:
df.isna().sum()

names        0
house        0
age          0
gender       0
age_group    0
dtype: int64

In [106]:
df.duplicated().sum()

np.int64(0)

In [107]:
df['age']

8    14
1    17
5    18
2    27
0    30
3    31
4    38
6    50
7    51
Name: age, dtype: int64

In [108]:
df

    names      house  age gender age_group
8   sansa      stark   14      f     young
1     jon      stark   17      m     young
5     rob      stark   18      m     young
2  tyrion   lenister   27      m     adult
0   cerci    unknown   30      f     adult
3   jimmy   lenister   31      m     adult
4   demon  targerion   38      m     adult
6     ned      stark   50      m     adult
7  robert   barathon   51      m     adult

In [109]:
df

    names      house  age gender age_group
8   sansa      stark   14      f     young
1     jon      stark   17      m     young
5     rob      stark   18      m     young
2  tyrion   lenister   27      m     adult
0   cerci    unknown   30      f     adult
3   jimmy   lenister   31      m     adult
4   demon  targerion   38      m     adult
6     ned      stark   50      m     adult
7  robert   barathon   51      m     adult

In [110]:
df[(df['age']> 10) & (df['gender']=='f')]

   names    house  age gender age_group
8  sansa    stark   14      f     young
0  cerci  unknown   30      f     adult

In [111]:
df['new_g'] = df['gender'].apply(lambda y : 'Male' if y == 'm' else 'Female')

In [112]:
df.drop(columns= 'gender',inplace = True)

In [113]:
df.rename(columns = {'new_g' :'gender'},inplace = True)

In [114]:
df

    names      house  age age_group  gender
8   sansa      stark   14     young  Female
1     jon      stark   17     young    Male
5     rob      stark   18     young    Male
2  tyrion   lenister   27     adult    Male
0   cerci    unknown   30     adult  Female
3   jimmy   lenister   31     adult    Male
4   demon  targerion   38     adult    Male
6     ned      stark   50     adult    Male
7  robert   barathon   51     adult    Male

In [115]:
df.iloc[0,1] = 'lanister'

In [116]:
df

    names      house  age age_group  gender
8   sansa   lanister   14     young  Female
1     jon      stark   17     young    Male
5     rob      stark   18     young    Male
2  tyrion   lenister   27     adult    Male
0   cerci    unknown   30     adult  Female
3   jimmy   lenister   31     adult    Male
4   demon  targerion   38     adult    Male
6     ned      stark   50     adult    Male
7  robert   barathon   51     adult    Male

In [117]:
df.loc[df['age'] > 40, 'category'] = 'cenior'

In [118]:
df

    names      house  age age_group  gender category
8   sansa   lanister   14     young  Female      NaN
1     jon      stark   17     young    Male      NaN
5     rob      stark   18     young    Male      NaN
2  tyrion   lenister   27     adult    Male      NaN
0   cerci    unknown   30     adult  Female      NaN
3   jimmy   lenister   31     adult    Male      NaN
4   demon  targerion   38     adult    Male      NaN
6     ned      stark   50     adult    Male   cenior
7  robert   barathon   51     adult    Male   cenior

In [119]:
df['category'] = np.where(df['age'] > 40, 'senior','intermediate ')

In [120]:
df.groupby('gender')['age'].mean()

gender
Female    22.000000
Male      33.142857
Name: age, dtype: float64

In [121]:
df

    names      house  age age_group  gender       category
8   sansa   lanister   14     young  Female  intermediate
1     jon      stark   17     young    Male  intermediate
5     rob      stark   18     young    Male  intermediate
2  tyrion   lenister   27     adult    Male  intermediate
0   cerci    unknown   30     adult  Female  intermediate
3   jimmy   lenister   31     adult    Male  intermediate
4   demon  targerion   38     adult    Male  intermediate
6     ned      stark   50     adult    Male         senior
7  robert   barathon   51     adult    Male         senior

In [122]:
import pandas as pd

data = {
    'Name': ['Amit', 'Riya', 'Vijay', 'Sneha', 'Arjun'],
    'Age': [23, 25, 22, 28, 24],
    'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'],
    'Salary': [50000, 60000, 52000, 65000, 58000]
}

df = pd.DataFrame(data)
print(df)

    Name  Age  Gender  Salary
0   Amit   23    Male   50000
1   Riya   25  Female   60000
2  Vijay   22    Male   52000
3  Sneha   28  Female   65000
4  Arjun   24    Male   58000

In [123]:
df[df['Gender'] =='Male'][['Name','Salary']]

    Name  Salary
0   Amit   50000
2  Vijay   52000
4  Arjun   58000

In [124]:
df

    Name  Age  Gender  Salary
0   Amit   23    Male   50000
1   Riya   25  Female   60000
2  Vijay   22    Male   52000
3  Sneha   28  Female   65000
4  Arjun   24    Male   58000

In [125]:
df[df['Gender'] == 'Female']['Salary'].mean()

np.float64(62500.0)

In [126]:
df[df['Gender'] == 'Male']['Salary'].max()

np.int64(58000)

In [127]:
df.groupby('Gender')['Salary'].mean().round()

Gender
Female    62500.0
Male      53333.0
Name: Salary, dtype: float64

In [128]:
df['Age']

0    23
1    25
2    22
3    28
4    24
Name: Age, dtype: int64

In [129]:
df.loc[df['Age'].idxmin(),'Name']

'Vijay'

In [130]:
df['Salary'].sum()

np.int64(285000)

In [131]:
df.loc[df['Age'] < 24]['Name']

0     Amit
2    Vijay
Name: Name, dtype: object

In [132]:
df['Age'].mean()

np.float64(24.4)

In [133]:
df['new_salary'] = df['Salary'] *1.10

In [134]:
df

    Name  Age  Gender  Salary  new_salary
0   Amit   23    Male   50000     55000.0
1   Riya   25  Female   60000     66000.0
2  Vijay   22    Male   52000     57200.0
3  Sneha   28  Female   65000     71500.0
4  Arjun   24    Male   58000     63800.0

In [135]:
df.sort_values('Salary',ascending=False)

    Name  Age  Gender  Salary  new_salary
3  Sneha   28  Female   65000     71500.0
1   Riya   25  Female   60000     66000.0
4  Arjun   24    Male   58000     63800.0
2  Vijay   22    Male   52000     57200.0
0   Amit   23    Male   50000     55000.0

In [136]:
df[df['Name'].str.startswith('A')]

    Name  Age Gender  Salary  new_salary
0   Amit   23   Male   50000     55000.0
4  Arjun   24   Male   58000     63800.0

In [137]:
df.value_counts('Gender')

Gender
Male      3
Female    2
Name: count, dtype: int64

In [138]:
df.loc[df['Age']< 25,'Age'] = 25

In [139]:
df

    Name  Age  Gender  Salary  new_salary
0   Amit   25    Male   50000     55000.0
1   Riya   25  Female   60000     66000.0
2  Vijay   25    Male   52000     57200.0
3  Sneha   28  Female   65000     71500.0
4  Arjun   25    Male   58000     63800.0

In [140]:
df['Age_group'] = np.where(df['Age']<26,'Young','adult')

In [141]:
df

    Name  Age  Gender  Salary  new_salary Age_group
0   Amit   25    Male   50000     55000.0     Young
1   Riya   25  Female   60000     66000.0     Young
2  Vijay   25    Male   52000     57200.0     Young
3  Sneha   28  Female   65000     71500.0     adult
4  Arjun   25    Male   58000     63800.0     Young

In [142]:
df['new_age'] =  df['Age'].apply(lambda y: 'yound' if y< 26 else 'adult')

In [143]:
df

    Name  Age  Gender  Salary  new_salary Age_group new_age
0   Amit   25    Male   50000     55000.0     Young   yound
1   Riya   25  Female   60000     66000.0     Young   yound
2  Vijay   25    Male   52000     57200.0     Young   yound
3  Sneha   28  Female   65000     71500.0     adult   adult
4  Arjun   25    Male   58000     63800.0     Young   yound

In [144]:
marks ={'names':['ragner','brejon','ubber',pd.NA,'floke','lagartha','gunhelt','torvi'],
            'age':[45,29,27,pd.NA,45,50,28,28],
                'kill':[pd.NA,1500,1000,50,1600,1800,100,500],
                    'gender':['m',pd.NA,'m','m','m','f','f','f']}

In [145]:
vi = pd.DataFrame(marks)

In [146]:
vi.isna().sum()

names     1
age       1
kill      1
gender    1
dtype: int64

In [147]:
vi.describe()

         names  age  kill gender
count        7    7     7      7
unique       7    5     7      2
top     ragner   45  1500      m
freq         1    2     1      4

In [148]:
vi.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   7 non-null      object
 1   age     7 non-null      object
 2   kill    7 non-null      object
 3   gender  7 non-null      object
dtypes: object(4)
memory usage: 388.0+ bytes

In [149]:
vi

      names   age  kill gender
0    ragner    45  <NA>      m
1    brejon    29  1500   <NA>
2     ubber    27  1000      m
3      <NA>  <NA>    50      m
4     floke    45  1600      m
5  lagartha    50  1800      f
6   gunhelt    28   100      f
7     torvi    28   500      f

In [150]:
vi.iloc[3,1] = 26

In [151]:
vi.iloc[1,3] = 'm'

In [152]:
vi.iloc[3,0] ='vitsk'

In [153]:
vi.loc[0,'kill'] = 2000

In [154]:
vi

      names age  kill gender
0    ragner  45  2000      m
1    brejon  29  1500      m
2     ubber  27  1000      m
3     vitsk  26    50      m
4     floke  45  1600      m
5  lagartha  50  1800      f
6   gunhelt  28   100      f
7     torvi  28   500      f

In [155]:
vi.loc[vi['age'] > 30, 'category'] = 'senior'
vi.loc[vi['age'] < 30, 'category'] = 'junior'
# df.loc[df['age'] > 40, 'category'] = 'cenior'

In [156]:
vi[vi['kill'] > 1000]['names']

0      ragner
1      brejon
4       floke
5    lagartha
Name: names, dtype: object

In [157]:
vi

      names age  kill gender category
0    ragner  45  2000      m   senior
1    brejon  29  1500      m   junior
2     ubber  27  1000      m   junior
3     vitsk  26    50      m   junior
4     floke  45  1600      m   senior
5  lagartha  50  1800      f   senior
6   gunhelt  28   100      f   junior
7     torvi  28   500      f   junior

In [158]:
vi.loc[vi['age'] < 30, 'age']

1    29
2    27
3    26
6    28
7    28
Name: age, dtype: object

In [159]:
vi.loc[vi['kill'] < 1000][['names','age','kill']]

     names age kill
3    vitsk  26   50
6  gunhelt  28  100
7    torvi  28  500

In [160]:
vi

      names age  kill gender category
0    ragner  45  2000      m   senior
1    brejon  29  1500      m   junior
2     ubber  27  1000      m   junior
3     vitsk  26    50      m   junior
4     floke  45  1600      m   senior
5  lagartha  50  1800      f   senior
6   gunhelt  28   100      f   junior
7     torvi  28   500      f   junior

In [161]:
vi[(vi['age']> 40) & (vi['kill'] > 1500) & (vi['category'] =='senior')]

      names age  kill gender category
0    ragner  45  2000      m   senior
4     floke  45  1600      m   senior
5  lagartha  50  1800      f   senior

In [162]:
vi.sort_values(by='names',inplace = True)

In [163]:
vi.sort_index()

      names age  kill gender category
0    ragner  45  2000      m   senior
1    brejon  29  1500      m   junior
2     ubber  27  1000      m   junior
3     vitsk  26    50      m   junior
4     floke  45  1600      m   senior
5  lagartha  50  1800      f   senior
6   gunhelt  28   100      f   junior
7     torvi  28   500      f   junior

In [164]:
vi.sort_values(by = 'age',inplace=True)

In [165]:
vi.loc[5,'age'] = 40

In [166]:
vi

      names age  kill gender category
3     vitsk  26    50      m   junior
2     ubber  27  1000      m   junior
6   gunhelt  28   100      f   junior
7     torvi  28   500      f   junior
1    brejon  29  1500      m   junior
4     floke  45  1600      m   senior
0    ragner  45  2000      m   senior
5  lagartha  40  1800      f   senior

In [167]:
import numpy as np

In [ ]:
# vi['titles'] = np.where(vi['kill'] > 1500, 'Dangerous', 
                    #   np.where(vi['kill'] > 1000, 'Middle', 'A Little Bit'))

In [ ]:
# vi['titles'] = np.select(
    # [vi['kill'] > 1500, vi['kill'] > 1000, vi['kill'] <= 1000],
    # ['Dangerous', 'Middle', 'A Little Bit'],
    # default='Safe'
# )
#

In [169]:
vi

      names age  kill gender category
3     vitsk  26    50      m   junior
2     ubber  27  1000      m   junior
6   gunhelt  28   100      f   junior
7     torvi  28   500      f   junior
1    brejon  29  1500      m   junior
4     floke  45  1600      m   senior
0    ragner  45  2000      m   senior
5  lagartha  40  1800      f   senior

In [182]:
# vi['title'] = np.select([vi['kill'] > 1500 ,vi['kill']>1000,vi['kill']>500,vi['kill'] < 500],
                        # ['Conquer','Ace','Crown','silver'],
                        # )

In [184]:
vi['title'] = np.select(
    [
        vi['kill'] > 1500,
        (vi['kill'] > 1000) & (vi['kill'] <= 1500),
        (vi['kill'] > 500) & (vi['kill'] <= 1000),
        vi['kill'] <= 500
    ],
    ['Conquer', 'Ace', 'Crown', 'Silver'],
    default  = 'safe'
)

In [185]:
vi

      names age  kill gender category    title
3     vitsk  26    50      m   junior   Silver
2     ubber  27  1000      m   junior    Crown
6   gunhelt  28   100      f   junior   Silver
7     torvi  28   500      f   junior   Silver
1    brejon  29  1500      m   junior      Ace
4     floke  45  1600      m   senior  Conquer
0    ragner  45  2000      m   senior  Conquer
5  lagartha  40  1800      f   senior  Conquer